# RbsEnergyAnalysisExportGbxmlDefaultsParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisExportGbxmlDefaultsParam Property
ParameterTypeId Class See Also
---
"Export Default Values"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisExportGbxmlDefaultsParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisExportGbxmlDefaultsParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisExportGbxmlDefaultsParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace